{
    "1": [
        {
            "Dimension": "Culture and Organization",
            "Sub Dimension": "Education and Guidance",
            "Activity": "Security consulting on request",
            "Level": "1",
            "Description": "Providing security consulting on request involves offering expert guidance and support to teams as needed to address specific security challenges or queries. This ensures that teams have access to specialized knowledge when implementing security measures. Pipeline-compatible tools like Slack and Microsoft Teams can facilitate communication and consultation requests within CI/CD workflows.",
            "Risk": "Not asking a security expert when questions regarding security appear might lead to flaws.",
            "Measure": "Security consulting to teams is given on request. The security consultants can be internal or external.",
            "Knowledge": "High (two disciplines)",
            "Resources": "Low",
            "Time": "Low",
            "Usefulness": "High",
            "SAMM": "G-EG-1-A",
            "ISO 27001:2017": "6.1.1",
            "ISO 27001:2022": "Security consulting is missing in ISO 27001 may be,5.2,5.6,5.8"
        },
        {
            "Dimension": "Culture and Organization",
            "Sub Dimension": "Design",
            "Activity": "Conduction of simple threat modeling on technical level",
            "Level": "1",
            "Description": "Conducting simple threat modeling on a technical level involves identifying potential security threats and vulnerabilities in the system's architecture and design. This helps in proactively addressing security concerns during the design phase. While pipeline-compatible tools for threat modeling are limited, methodologies like STRIDE and tools such as Microsoft Threat Modeling Tool can be utilized to standardize threat identification processes.",
            "Risk": "Technical related threats are discovered too late in the development and deployment process.",
            "Measure": "Threat modeling of technical features is performed during the product sprint planning.",
            "Knowledge": "Medium (two disciplines)",
            "Resources": "Low",
            "Time": "High",
            "Usefulness": "High",
            "SAMM": "D-TA-2-B",
            "ISO 27001:2017": "14.2.1",
            "ISO 27001:2022": "Not explicitly covered by ISO 27001,May be part of risk assessment,5.12,8.25"
        },
        {
            "Dimension": "Implementation",
            "Sub Dimension": "Infrastructure Hardening",
            "Activity": "Simple access control for systems",
            "Level": "1",
            "Description": "Implementing simple access control for systems involves setting up basic authentication and authorization mechanisms to restrict access to authorized users only. While pipeline-compatible tools for basic access control are limited, standalone solutions like SSH key management and basic firewall configurations can be employed.",
            "Risk": "Attackers a gaining access to internal systems and application interfaces",
            "Measure": "All internal systems are using simple authentication",
            "Knowledge": "High (two disciplines)",
            "Resources": "High",
            "Time": "High",
            "Usefulness": "",
            "SAMM": "O-EM-1-A",
            "ISO 27001:2017": "9.4.1",
            "ISO 27001:2022": "8.3"
        },
        {
            "Dimension": "Culture and Organization",
            "Sub Dimension": "Education and Guidance",
            "Activity": "Ad-Hoc Security trainings for software developers",
            "Level": "1",
            "Description": "Conducting ad-hoc security trainings for software developers involves providing occasional training sessions focused on security best practices and awareness to enhance the security skills of the development team. While not directly pipeline-compatible, platforms like Pluralsight and Udemy offer security training modules that can be integrated into developer onboarding processes.",
            "Risk": "Understanding security is hard and personnel needs to be trained on it. Otherwise, flaws like an SQL Injection might be introduced into the software which might get exploited.",
            "Measure": "Provide security awareness training for all personnel involved in software development Ad-Hoc.",
            "Knowledge": "Medium (two disciplines)",
            "Resources": "Low",
            "Time": "Low",
            "Usefulness": "High",
            "SAMM": "G-EG-1-A",
            "ISO 27001:2017": "7/1/2002",
            "ISO 27001:2022": "6.3"
        },
        {
            "Dimension": "Build and Deployment",
            "Sub Dimension": "Patch Management",
            "Activity": "A patch policy is defined",
            "Level": "1",
            "Description": "A patch policy for all artifacts (e.g., in images) is defined. This includes specifying how often an image is rebuilt to ensure vulnerabilities are patched in a timely manner.",
            "Risk": "Vulnerabilities in running artifacts stay for long and might get exploited.",
            "Measure": "A patch policy for all artifacts (e.g. in images) is defined. How often is an image rebuilt?",
            "Knowledge": "High (two disciplines)",
            "Resources": "Medium",
            "Time": "Low",
            "Usefulness": "Very High",
            "SAMM": "O-EM-1-B",
            "ISO 27001:2017": "14.2.5",
            "ISO 27001:2022": "8.8,8.19,8.27"
        },
        {
            "Dimension": "Build and Deployment",
            "Sub Dimension": "Deployment",
            "Activity": "Defined deployment process",
            "Level": "1",
            "Description": "Defining a deployment process ensures that there are established criteria in terms of functionalities, security, compliance, and performance, and that the artifacts meet them. This structured approach reduces the risk of deploying insecure or malfunctioning artifacts.",
            "Risk": "Deployment of insecure or malfunctioning artifacts.",
            "Measure": "Defining a deployment process ensures that there are established criteria in terms of functionalities, security, compliance, and performance, and that the artifacts meet them.",
            "Knowledge": "Medium (two disciplines)",
            "Resources": "Low",
            "Time": "Medium",
            "Usefulness": "Very High",
            "SAMM": "I-SD-1-A",
            "ISO 27001:2017": "14.2.2",
            "ISO 27001:2022": "5.37,8.32"
        }
    ],
    "2": [
        {
            "Dimension": "Culture and Organization",
            "Sub Dimension": "Education and Guidance",
            "Activity": "Reward of good communication",
            "Level": "2",
            "Description": "Rewarding good communication involves recognizing and incentivizing effective information sharing and collaboration among team members. This fosters a culture of transparency, encourages proactive security practices, and enhances overall team cohesion. Pipeline-compatible tools like Slack and Microsoft Teams can facilitate communication, while platforms like Bonusly can manage rewards and recognition within CI/CD workflows.",
            "Risk": "Employees are not getting excited about security.",
            "Measure": "Good communication and transparency encourages cross-organizational support. Gamification of security is also known to help, examples include T-Shirts, mugs, cups, gift cards and 'High-Fives'.",
            "Knowledge": "High (two disciplines)",
            "Resources": "Low",
            "Time": "Medium",
            "Usefulness": "High",
            "SAMM": "G-EG-1-B",
            "ISO 27001:2017": "interestingly enough A7.2.3 is requiring a process to handle misconduct but nothing to promote good behavior.",
            "ISO 27001:2022": "ISO 27001:2022 mapping is missing"
        },
        {
            "Dimension": "Culture and Organization",
            "Sub Dimension": "Education and Guidance",
            "Activity": "Regular security training of security champions",
            "Level": "2",
            "Description": "Providing regular security training to security champions ensures they are well-equipped with the latest security knowledge and best practices. This enables them to effectively guide their teams and address emerging security challenges. Pipeline-compatible tools like Learning Management Systems (LMS) such as Moodle or Coursera can facilitate ongoing training and certification for security champions.",
            "Risk": "Understanding security is hard, even for security champions.",
            "Measure": "Regular security training of security champions.",
            "Knowledge": "Very High (three or more disciplines)",
            "Resources": "Medium",
            "Time": "Medium",
            "Usefulness": "",
            "SAMM": "D-TA-2-B,G-EG-1-A",
            "ISO 27001:2017": "7/1/2002",
            "ISO 27001:2022": "Security champions are missing in ISO 27001,6.3"
        },
        {
            "Dimension": "Culture and Organization",
            "Sub Dimension": "Education and Guidance",
            "Activity": "Regular security training for all",
            "Level": "2",
            "Description": "Providing regular security training for all employees ensures that everyone is aware of security policies, best practices, and emerging threats, fostering a security-conscious organizational culture. While pipeline-compatible tools are not directly applicable, Learning Management Systems (LMS) like Moodle or Coursera can facilitate regular training sessions.",
            "Risk": "Understanding security is hard.",
            "Measure": "Provide security awareness training for all internal personnel involved in software development on a regular basis like twice in a year for 1-3 days.",
            "Knowledge": "High (two disciplines)",
            "Resources": "Medium",
            "Time": "Very High",
            "Usefulness": "Very High",
            "SAMM": "G-EG-1-A",
            "ISO 27001:2017": "7/1/2002",
            "ISO 27001:2022": "6.3"
        },
        {
            "Dimension": "Culture and Organization",
            "Sub Dimension": "Design",
            "Activity": "Information security targets are communicated",
            "Level": "2",
            "Description": "Communicating information security targets involves clearly conveying the organization's security goals, policies, and expectations to all stakeholders, ensuring alignment and understanding across the board. This activity primarily relies on documentation and communication tools rather than pipeline-compatible tools.",
            "Risk": "Employees don't know their organizations security targets. Therefore security is not considered during development and administration as much as it should be.",
            "Measure": "Transparent and timely communication of the security targets by senior management is essential to ensure teams' buy-in and support.",
            "Knowledge": "Low (one discipline)",
            "Resources": "Low",
            "Time": "Low",
            "Usefulness": "High",
            "SAMM": "",
            "ISO 27001:2017": "5.1.1",
            "ISO 27001:2022": "5.1,5.4"
        }
    ],
    "4": [
        {
            "Dimension": "Culture and Organization",
            "Sub Dimension": "Education and Guidance",
            "Activity": "Conduction of war games",
            "Level": "4",
            "Description": "Conducting war games involves simulating real-world cyberattack scenarios to test the organization's incident response capabilities and identify potential security weaknesses. This practice enhances preparedness, improves coordination among teams, and strengthens overall security posture. Pipeline-compatible tools like SimSpace and BattleEye can facilitate the automation and integration of war games within CI/CD pipelines.",
            "Risk": "Understanding incident response plans during an incident is hard and ineffective.",
            "Measure": "War Games like activities help train for incidents. Security SMEs create attack scenarios in a testing environment enabling the trainees to learn how to react in case of an incident.",
            "Knowledge": "Very High (three or more disciplines)",
            "Resources": "Very High",
            "Time": "",
            "Usefulness": "High",
            "SAMM": "G-EG-2-A",
            "ISO 27001:2017": "16.1.5",
            "ISO 27001:2022": "War games are not explicitly required in ISO 27001 may be,6.3,5.24,5.26"
        },
        {
            "Dimension": "Implementation",
            "Sub Dimension": "Development and Source Control",
            "Activity": ".gitignore",
            "Level": "4",
            "Description": "Configuring a .gitignore file involves specifying files and directories that should be excluded from version control to prevent sensitive information, build artifacts, and unnecessary files from being tracked. Pipeline-compatible tools like GitHub, GitLab, and Bitbucket can utilize .gitignore configurations to streamline version control processes within CI/CD pipelines.",
            "Risk": "Unintended leakage of secrets, debug, or workstation specific data",
            "Measure": ".gitignore files help prevent accidental commits of secrets, debug, or workstation specific data",
            "Knowledge": "Medium (two disciplines)",
            "Resources": "Low",
            "Time": "Low",
            "Usefulness": "",
            "SAMM": "O-EM-1-A",
            "ISO 27001:2017": "12.1.1",
            "ISO 27001:2022": "Not explicitly covered by ISO 27001 - too specific,5.37,8.32"
        },
        {
            "Dimension": "Culture and Organization",
            "Sub Dimension": "Education and Guidance",
            "Activity": "Regular security training for externals",
            "Level": "4",
            "Description": "Conducting regular security training for externals, such as contractors or third-party vendors, ensures that they adhere to the organization's security standards and understand their responsibilities in maintaining security. Tools like LinkedIn Learning and external LMS platforms can support these training initiatives.",
            "Risk": "Understanding security is hard.",
            "Measure": "Provide security awareness training for all personnel including externals involved in software development on a regular basis.",
            "Knowledge": "High (two disciplines)",
            "Resources": "High",
            "Time": "Medium",
            "Usefulness": "Very High",
            "SAMM": "G-EG-3-A",
            "ISO 27001:2017": "7/1/2002",
            "ISO 27001:2022": "6.3"
        }
    ],
    "5": [
        {
            "Dimension": "Culture and Organization",
            "Sub Dimension": "Design",
            "Activity": "Creation of advanced abuse stories",
            "Level": "5",
            "Description": "Creating advanced abuse stories involves developing detailed and complex scenarios where malicious actors attempt to exploit system vulnerabilities. These stories help in understanding potential attack vectors, enhancing security measures, and improving incident response strategies. While not directly pipeline-compatible, frameworks like MITRE ATT&CK can inform the creation of these abuse stories.",
            "Risk": "Simple user stories are not going deep enough. Relevant security considerations are performed. Security flaws are discovered too late in the development and deployment process",
            "Measure": "Advanced abuse stories are created as part of threat modeling activities.",
            "Knowledge": "Very High (three or more disciplines)",
            "Resources": "Low",
            "Time": "Medium",
            "Usefulness": "Very High",
            "SAMM": "D-TA-2-B",
            "ISO 27001:2017": "5/31/2005",
            "ISO 27001:2022": "Not explicitly covered by ISO 27001,May be part of project management,5.8,May be part of risk assessment,5.9"
        }
    ],
    "3": [
        {
            "Dimension": "Culture and Organization",
            "Sub Dimension": "Design",
            "Activity": "Creation of simple abuse stories",
            "Level": "3",
            "Description": "Creating simple abuse stories involves developing basic scenarios where attackers exploit common vulnerabilities. These stories assist in identifying fundamental security gaps and informing the development of effective security controls. Tools like OWASP Threat Dragon can aid in visualizing these scenarios within development workflows.",
            "Risk": "User stories mostly don't consider security implications. Security flaws are discovered too late in the development and deployment process.",
            "Measure": "Abuse stories are created during the creation of user stories.",
            "Knowledge": "Medium (two disciplines)",
            "Resources": "Low",
            "Time": "Medium",
            "Usefulness": "Very High",
            "SAMM": "D-TA-2-B",
            "ISO 27001:2017": "5/31/2005",
            "ISO 27001:2022": "Not explicitly covered by ISO 27001,May be part of project management,5.8,May be part of risk assessment,5.9"
        },
        {
            "Dimension": "Culture and Organization",
            "Sub Dimension": "Education and Guidance",
            "Activity": "Conduction of build-it, break-it, fix-it contests",
            "Level": "3",
            "Description": "Conducting build-it, break-it, fix-it contests involves organizing events where teams build applications, attempt to break them by identifying vulnerabilities, and then fix the issues. This hands-on approach promotes practical security skills and fosters a culture of continuous improvement. While not pipeline-compatible, tools like GitHub Actions can automate parts of the contest workflows.",
            "Risk": "Understanding security is hard, even for security champions and the conduction of security training often focuses on breaking a component instead of building a component secure.",
            "Measure": "The build-it, break-it, fix-it contest allows to train people with security related roles like security champions the build, break and fix part of a secure application. This increases the learning of building secure components.",
            "Knowledge": "",
            "Resources": "Low",
            "Time": "High",
            "Usefulness": "High",
            "SAMM": "G-EG-2-A",
            "ISO 27001:2017": "7/1/2002",
            "ISO 27001:2022": "6.3"
        },
        {
            "Dimension": "Culture and Organization",
            "Sub Dimension": "Education and Guidance",
            "Activity": "Office Hours",
            "Level": "3",
            "Description": "Organizing office hours involves setting aside dedicated time for team members to seek guidance, ask questions, and discuss security-related concerns with security experts or coaches, promoting an open and supportive security culture. This activity does not typically involve pipeline-compatible tools.",
            "Risk": "Developers and Operations are not in contact with the security team and therefore do not ask prior implementation of (known or unknown) threats-",
            "Measure": "As a security team, be open for questions and hints during defined office hours. x x d",
            "Knowledge": "Low (one discipline)",
            "Resources": "Low",
            "Time": "Low",
            "Usefulness": "High",
            "SAMM": "G-EG-1-A",
            "ISO 27001:2017": "7/1/2002",
            "ISO 27001:2022": "6.3"
        },
        {
            "Dimension": "Culture and Organization",
            "Sub Dimension": "Education and Guidance",
            "Activity": "Simple mob hacking",
            "Level": "3",
            "Description": "Conducting simple mob hacking sessions involves organizing interactive team activities where participants collaboratively work on identifying and exploiting vulnerabilities in a controlled environment. These sessions enhance the team's understanding of security principles and improve their ability to recognize and mitigate security threats effectively.",
            "Languages": []
        },
        {
            "Dimension": "Culture and Organization",
            "Sub Dimension": "Process",
            "Activity": "Definition of a change management process",
            "Level": "3",
            "Description": "Defining a change management process involves establishing structured procedures for requesting, reviewing, approving, and implementing changes to the infrastructure and applications. This ensures that changes are made systematically, reducing the risk of introducing vulnerabilities or disruptions. Pipeline-compatible tools like Jira, ServiceNow, and GitLab can automate aspects of the change management process within CI/CD pipelines.",
            "Risk": "The impact of a change is not controlled because these are not recorded or documented.",
            "Measure": "Each change of a system is automatically recorded and adequately logged.",
            "Knowledge": "Very High (three or more disciplines)",
            "Resources": "Low",
            "Time": "High",
            "Usefulness": "High",
            "SAMM": "",
            "ISO 27001:2017": "11/30/2002",
            "ISO 27001:2022": "8.32,8.15"
        }
    ]
}